brew "atuin", restart_service: :changed
brew "ca-certificates"
brew "openssl@3", link: false
brew "bat"
brew "btop"
brew "certifi"
brew "cmatrix"
brew "duf"
brew "fd"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gitleaks"
brew "hadolint"
brew "helm"
brew "just"
brew "kubernetes-cli"
brew "libomp"
brew "neovim"
brew "ripgrep"
brew "openjdk@17"
brew "poetry"
brew "pre-commit"
brew "pstree"
brew "ruff"
brew "scc"
brew "starship"
brew "stow"
brew "television"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "uv"
brew "worktrunk"
brew "zoxide"
brew "k9s"
brew "fastfetch"
cask "ghostty"
cask "git-credential-manager"
cask "font-hack-nerd-font"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "bruno-api-client.bruno"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "teabyii.ayu"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "pomdtr.excalidraw-editor"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
