tap "databricks/tap"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "humansignal/tap"
brew "act"
brew "atuin", restart_service: :changed
brew "ca-certificates"
brew "openssl@3", link: false
brew "bat"
brew "btop"
brew "certifi"
brew "cmatrix"
brew "cowsay"
brew "duf"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "fzf"
brew "gemini-cli"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gitleaks"
brew "hadolint"
brew "handbrake"
brew "helm"
brew "imagemagick"
brew "just"
brew "kubernetes-cli"
brew "libomp"
brew "minikube"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "openjdk@17"
brew "poetry"
brew "pre-commit"
brew "pstree"
brew "ruff"
brew "scc"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "uv"
brew "wtf"
brew "zoxide"
brew "databricks/tap/databricks"
cask "alt-tab"
cask "betterdisplay"
cask "displaylink"
cask "docker-desktop"
cask "ghostty"
cask "git-credential-manager"
cask "philips-hue-sync"
cask "r-app"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "bruno-api-client.bruno"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "google.geminicodeassist"
vscode "hediet.vscode-drawio"
vscode "helgardrichard.helium-icon-theme"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "pomdtr.excalidraw-editor"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "stoplight.spectral"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
